# -*- coding: utf-8 -*-
import re
import urllib2
import json

# html = urllib2.urlopen(r'http://192.168.2.251:8101/Pub/GetSpecialtyList')
# hjson = json.loads(html.read())
# list_data = hjson['Data']
# for data in list_data:
#     isActive = data['State'] == 1
#     if isActive:
#         print data['SpecialtyName']
#         print data['FullSpecialtyName']

html =\
'''
{
	"outline": null,
	"outlineMiss": null,
	"font": {
		"173e5fb4dd3383c4bb4cd2720010001": "宋体",
		"173e5fb4dd3383c4bb4cd2720020001": "宋体",
		"173e5fb4dd3383c4bb4cd2720030001": "黑体",
		"173e5fb4dd3383c4bb4cd2720040001": "Arial Black"
	},
	"style": [{
		"t": "style",
		"c": [0],
		"s": {
			"bold": "true",
			"font-size": "30.06"
		}
	}, {
		"t": "style",
		"c": [0, 2, 3, 4, 1],
		"s": {
			"color": "#000000"
		}
	}, {
		"t": "style",
		"c": [2],
		"s": {
			"font-family": "173e5fb4dd3383c4bb4cd2720010001"
		}
	}, {
		"t": "style",
		"c": [2, 4, 3],
		"s": {
			"font-size": "18"
		}
	}, {
		"t": "style",
		"c": [4],
		"s": {
			"font-family": "173e5fb4dd3383c4bb4cd2720020001"
		}
	}],
	"body": [{
		"c": {
			"ix": 0,
			"iy": 0,
			"iw": 720,
			"ih": 921,
			"wap": {
				"ix": 0,
				"iy": 0,
				"iw": 720,
				"ih": 921
			}
		},
		"p": {
			"h": 921,
			"w": 720.105,
			"x": 80.895,
			"y": 199.895,
			"z": 104
		},
		"ps": {
			"_vector": 1
		},
		"s": null,
		"t": "pic"
	}, {
		"c": "医疗器械产品分",
		"p": {
			"h": 30.06,
			"w": 212.579,
			"x": 625.245,
			"y": 117.488,
			"z": 177
		},
		"ps": {
			"_enter": 1
		},
		"s": {
			"font-family": "173e5fb4dd3383c4bb4cd2720030001",
			"letter-spacing": "0.36"
		},
		"t": "word",
		"r": [0]
	}, {
		"c": "Medical Equipment Classific",
		"p": {
			"h": 32.194,
			"w": 465.809,
			"x": 429.555,
			"y": 156.908,
			"z": 210
		},
		"ps": {
			"_enter": 1
		},
		"s": {
			"font-family": "173e5fb4dd3383c4bb4cd2720040001"
		},
		"t": "word",
		"r": [0]
	}, {
		"c": "序",
		"p": {
			"h": 18,
			"w": 18,
			"x": 92.52,
			"y": 253.307,
			"z": 105
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [2]
	}, {
		"c": "号",
		"p": {
			"h": 18,
			"w": 18,
			"x": 92.52,
			"y": 275.267,
			"z": 106
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [2]
	}, {
		"c": "Ser",
		"p": {
			"h": 18,
			"w": 27,
			"x": 88.02,
			"y": 297.228,
			"z": 107
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "ial",
		"p": {
			"h": 18,
			"w": 27,
			"x": 88.02,
			"y": 319.188,
			"z": 108
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "NO.",
		"p": {
			"h": 18,
			"w": 27,
			"x": 88.02,
			"y": 341.147,
			"z": 109
		},
		"ps": {
			"_cover": true,
			"_enter": 1
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "分类",
		"p": {
			"h": 18,
			"w": 36,
			"x": 129.816,
			"y": 242.327,
			"z": 110
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [2]
	}, {
		"c": "编码",
		"p": {
			"h": 18,
			"w": 36,
			"x": 129.816,
			"y": 264.288,
			"z": 111
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [2]
	}, {
		"c": "Class",
		"p": {
			"h": 18,
			"w": 45,
			"x": 125.316,
			"y": 286.247,
			"z": 112
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "ifica",
		"p": {
			"h": 18,
			"w": 45,
			"x": 125.316,
			"y": 308.207,
			"z": 113
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "tion",
		"p": {
			"h": 18,
			"w": 36,
			"x": 129.816,
			"y": 330.167,
			"z": 114
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "Code",
		"p": {
			"h": 18,
			"w": 36,
			"x": 129.816,
			"y": 352.128,
			"z": 115
		},
		"ps": {
			"_cover": true,
			"_enter": 1
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "监管类",
		"p": {
			"h": 18,
			"w": 54,
			"x": 180.929,
			"y": 209.387,
			"z": 116
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [2]
	}, {
		"c": "别",
		"p": {
			"h": 18,
			"w": 18,
			"x": 198.93,
			"y": 231.347,
			"z": 117
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [2]
	}, {
		"c": "Superv",
		"p": {
			"h": 18,
			"w": 54,
			"x": 180.929,
			"y": 253.307,
			"z": 118
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "ision",
		"p": {
			"h": 18,
			"w": 45,
			"x": 185.429,
			"y": 275.267,
			"z": 119
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "&",
		"p": {
			"h": 18,
			"w": 9,
			"x": 203.43,
			"y": 297.228,
			"z": 120
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "Admini",
		"p": {
			"h": 18,
			"w": 54,
			"x": 180.929,
			"y": 319.188,
			"z": 121
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "strati",
		"p": {
			"h": 18,
			"w": 54,
			"x": 180.929,
			"y": 341.147,
			"z": 122
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "on",
		"p": {
			"h": 18,
			"w": 18,
			"x": 198.93,
			"y": 363.107,
			"z": 123
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "Level",
		"p": {
			"h": 18,
			"w": 45,
			"x": 185.429,
			"y": 385.068,
			"z": 124
		},
		"ps": {
			"_cover": true,
			"_enter": 1
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "名称",
		"p": {
			"h": 18,
			"w": 36,
			"x": 502.305,
			"y": 286.247,
			"z": 125
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [2]
	}, {
		"c": "Name",
		"p": {
			"h": 18,
			"w": 36,
			"x": 502.305,
			"y": 308.207,
			"z": 126
		},
		"ps": {
			"_cover": true,
			"_enter": 1
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "1",
		"p": {
			"h": 18,
			"w": 9,
			"x": 97.596,
			"y": 439.832,
			"z": 127
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "6801",
		"p": {
			"h": 18,
			"w": 36,
			"x": 129.816,
			"y": 439.832,
			"z": 128
		},
		"ps": {
			"_cover": true,
			"_enter": 1
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "基础外科手术器械",
		"p": {
			"h": 18,
			"w": 144,
			"x": 244.649,
			"y": 428.852,
			"z": 129
		},
		"ps": {
			"_cover": true,
			"_enter": 1
		},
		"t": "word",
		"r": [2]
	}, {
		"c": "basic surgical operation instruments",
		"p": {
			"h": 18,
			"w": 324,
			"x": 244.649,
			"y": 450.812,
			"z": 130
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "医用缝合针(不带线)",
		"p": {
			"h": 18,
			"w": 162,
			"x": 244.649,
			"y": 505.892,
			"z": 135
		},
		"ps": {
			"_cover": true,
			"_enter": 1
		},
		"t": "word",
		"r": [2]
	}, {
		"c": "medical suture needle (without thread)",
		"p": {
			"h": 18,
			"w": 342,
			"x": 244.649,
			"y": 527.853,
			"z": 136
		},
		"ps": {
			"_cover": true,
			"_enter": 1
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "2",
		"p": {
			"h": 18,
			"w": 9,
			"x": 97.596,
			"y": 516.872,
			"z": 131
		},
		"ps": {
			"_cover": true,
			"_enter": 1
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "6801-",
		"p": {
			"h": 18,
			"w": 45,
			"x": 125.316,
			"y": 505.892,
			"z": 132
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "01",
		"p": {
			"h": 18,
			"w": 18,
			"x": 138.816,
			"y": 527.853,
			"z": 133
		},
		"ps": {
			"_cover": true,
			"_enter": 1
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "Ⅱ类",
		"p": {
			"h": 18,
			"w": 36,
			"x": 189.929,
			"y": 516.872,
			"z": 134
		},
		"ps": {
			"_cover": true,
			"_enter": 1
		},
		"t": "word",
		"r": [2]
	}, {
		"c": "3",
		"p": {
			"h": 18,
			"w": 9,
			"x": 97.596,
			"y": 602.192,
			"z": 137
		},
		"ps": {
			"_cover": true,
			"_enter": 1
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "6801-",
		"p": {
			"h": 18,
			"w": 45,
			"x": 125.316,
			"y": 591.213,
			"z": 138
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "02",
		"p": {
			"h": 18,
			"w": 18,
			"x": 138.816,
			"y": 613.172,
			"z": 139
		},
		"ps": {
			"_cover": true,
			"_enter": 1
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "Ⅰ类",
		"p": {
			"h": 18,
			"w": 36,
			"x": 189.929,
			"y": 602.192,
			"z": 140
		},
		"ps": {
			"_cover": true,
			"_enter": 1
		},
		"t": "word",
		"r": [2]
	}, {
		"c": "基础外科用刀",
		"p": {
			"h": 18,
			"w": 108,
			"x": 244.649,
			"y": 591.213,
			"z": 141
		},
		"ps": {
			"_cover": true,
			"_enter": 1
		},
		"t": "word",
		"r": [2]
	}, {
		"c": "basic surgical knife",
		"p": {
			"h": 18,
			"w": 180,
			"x": 244.649,
			"y": 613.172,
			"z": 142
		},
		"ps": {
			"_cover": true,
			"_enter": 1
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "4",
		"p": {
			"h": 18,
			"w": 9,
			"x": 97.596,
			"y": 687.542,
			"z": 143
		},
		"ps": {
			"_cover": true,
			"_enter": 1
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "6801-",
		"p": {
			"h": 18,
			"w": 45,
			"x": 125.316,
			"y": 676.562,
			"z": 144
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "03",
		"p": {
			"h": 18,
			"w": 18,
			"x": 138.816,
			"y": 698.522,
			"z": 145
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "6801-",
		"p": {
			"h": 18,
			"w": 45,
			"x": 125.316,
			"y": 753.603,
			"z": 150
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "04",
		"p": {
			"h": 18,
			"w": 18,
			"x": 138.816,
			"y": 775.562,
			"z": 151
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "6801-",
		"p": {
			"h": 18,
			"w": 45,
			"x": 125.316,
			"y": 830.642,
			"z": 156
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "05",
		"p": {
			"h": 18,
			"w": 18,
			"x": 138.816,
			"y": 852.603,
			"z": 157
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "6801-",
		"p": {
			"h": 18,
			"w": 45,
			"x": 125.316,
			"y": 907.682,
			"z": 162
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "06",
		"p": {
			"h": 18,
			"w": 18,
			"x": 138.816,
			"y": 929.687,
			"z": 163
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "6801-",
		"p": {
			"h": 18,
			"w": 45,
			"x": 125.316,
			"y": 984.767,
			"z": 168
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "07",
		"p": {
			"h": 18,
			"w": 18,
			"x": 138.816,
			"y": 1006.727,
			"z": 169
		},
		"ps": {
			"_cover": true,
			"_enter": 1
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "Ⅰ类",
		"p": {
			"h": 18,
			"w": 36,
			"x": 189.929,
			"y": 687.542,
			"z": 146
		},
		"ps": {
			"_cover": true,
			"_enter": 1
		},
		"t": "word",
		"r": [2]
	}, {
		"c": "基础外科用剪",
		"p": {
			"h": 18,
			"w": 108,
			"x": 244.649,
			"y": 676.562,
			"z": 147
		},
		"ps": {
			"_cover": true,
			"_enter": 1
		},
		"t": "word",
		"r": [2]
	}, {
		"c": "basic surgical scissors",
		"p": {
			"h": 18,
			"w": 207,
			"x": 244.649,
			"y": 698.522,
			"z": 148
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "基础外科用钳",
		"p": {
			"h": 18,
			"w": 108,
			"x": 244.649,
			"y": 753.603,
			"z": 153
		},
		"ps": {
			"_cover": true,
			"_enter": 1
		},
		"t": "word",
		"r": [2]
	}, {
		"c": "basic surgical clamp",
		"p": {
			"h": 18,
			"w": 180,
			"x": 244.649,
			"y": 775.562,
			"z": 154
		},
		"ps": {
			"_cover": true,
			"_enter": 1
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "基础外科用镊、夹",
		"p": {
			"h": 18,
			"w": 144,
			"x": 244.649,
			"y": 830.642,
			"z": 159
		},
		"ps": {
			"_cover": true,
			"_enter": 1
		},
		"t": "word",
		"r": [2]
	}, {
		"c": "basic surgical tweezer & clip",
		"p": {
			"h": 18,
			"w": 261,
			"x": 244.649,
			"y": 852.603,
			"z": 160
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "基础外科用针、钩",
		"p": {
			"h": 18,
			"w": 144,
			"x": 244.649,
			"y": 907.682,
			"z": 165
		},
		"ps": {
			"_cover": true,
			"_enter": 1
		},
		"t": "word",
		"r": [2]
	}, {
		"c": "basic surgical needle、hook",
		"p": {
			"h": 18,
			"w": 243,
			"x": 244.649,
			"y": 929.687,
			"z": 166
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [2]
	}, {
		"c": "基础外科其它器械",
		"p": {
			"h": 18,
			"w": 144,
			"x": 244.649,
			"y": 984.767,
			"z": 171
		},
		"ps": {
			"_cover": true,
			"_enter": 1
		},
		"t": "word",
		"r": [2]
	}, {
		"c": "other basic surgical instruments",
		"p": {
			"h": 18,
			"w": 288,
			"x": 244.649,
			"y": 1006.727,
			"z": 172
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "显微外科手术器械",
		"p": {
			"h": 18,
			"w": 144,
			"x": 244.649,
			"y": 1061.808,
			"z": 175
		},
		"ps": {
			"_cover": true,
			"_enter": 1
		},
		"t": "word",
		"r": [2]
	}, {
		"c": "microsurgical operation instruments",
		"p": {
			"h": 18,
			"w": 315,
			"x": 244.649,
			"y": 1083.768,
			"z": 176
		},
		"ps": {
			"_cover": true,
			"_enter": 1
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "5",
		"p": {
			"h": 18,
			"w": 9,
			"x": 97.596,
			"y": 764.582,
			"z": 149
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "Ⅰ类",
		"p": {
			"h": 18,
			"w": 36,
			"x": 189.929,
			"y": 764.582,
			"z": 152
		},
		"ps": {
			"_cover": true,
			"_enter": 1
		},
		"t": "word",
		"r": [2]
	}, {
		"c": "6",
		"p": {
			"h": 18,
			"w": 9,
			"x": 97.596,
			"y": 841.622,
			"z": 155
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "Ⅰ类",
		"p": {
			"h": 18,
			"w": 36,
			"x": 189.929,
			"y": 841.622,
			"z": 158
		},
		"ps": {
			"_cover": true,
			"_enter": 1
		},
		"t": "word",
		"r": [2]
	}, {
		"c": "7",
		"p": {
			"h": 18,
			"w": 9,
			"x": 97.596,
			"y": 918.662,
			"z": 161
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "Ⅰ类",
		"p": {
			"h": 18,
			"w": 36,
			"x": 189.929,
			"y": 918.662,
			"z": 164
		},
		"ps": {
			"_cover": true,
			"_enter": 1
		},
		"t": "word",
		"r": [2]
	}, {
		"c": "8",
		"p": {
			"h": 18,
			"w": 9,
			"x": 97.596,
			"y": 995.747,
			"z": 167
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "Ⅰ类",
		"p": {
			"h": 18,
			"w": 36,
			"x": 189.929,
			"y": 995.747,
			"z": 170
		},
		"ps": {
			"_cover": true,
			"_enter": 1
		},
		"t": "word",
		"r": [2]
	}, {
		"c": "9",
		"p": {
			"h": 18,
			"w": 9,
			"x": 97.596,
			"y": 1072.788,
			"z": 173
		},
		"ps": {
			"_cover": true
		},
		"t": "word",
		"r": [4]
	}, {
		"c": "6802",
		"p": {
			"h": 18,
			"w": 36,
			"x": 129.816,
			"y": 1072.788,
			"z": 174
		},
		"ps": {
			"_cover": true,
			"_enter": 1
		},
		"t": "word",
		"r": [4]
	}],
	"page": {
		"ph": 1262.879,
		"pw": 892.979,
		"iw": 720,
		"ih": 921,
		"v": 6,
		"t": "2",
		"pptlike": false,
		"cx": 80.895,
		"cy": 117.488,
		"cw": 812.084,
		"ch": 1003.512
	}
}
'''
text = json.loads(html)
i = 1
for js in text['body']:
    if i == 1:
        i += 1
        continue
    str1 = js['c'].encode('utf-8')
    if not re.compile("^\d").search(str1) and not re.compile("^Ⅰ|^Ⅲ").search(str1):
        print str1

